lan-hx/stm32_lora/tasks/service/web/data_link.cpp
/**
 * @brief 数据链路层
 * @author lan
 */

// #define DATALINK_DBG
// #define NETWORK_DBG
#define DATALINK_IMPL
#define DATA_LINK_SEMAPHORE
#define DATA_LINK_TIMER
#include "service/web/data_link.h"

#include <string.h>

#include "crc.h"
#include "service/lora/lora.h"
#include "stm32f1xx_hal_crc.h"
#include "utility.h"

enum DataLinkSignalEnum : uint8_t {
  RX_Packet,  // 收包
  TX_Packet,  // 发包
  TX_Ack,     // 发ack包
  TX_Retry,   // 发重传包

  TX_Init,             // 初始状态
  TX_Wait_Lora,        // 等到物理层发包
  TX_Packet_Wait,      // 等待Ack包(此时不能发下一个普通包)
  TX_Route_Packet,     // m3新增，发送路由包
  TX_Transfer_Packet,  // m3新增，转发一个包
};

/*发普通包时: TX_Init —— TX_Packet —— TX_Wait_Lora —— TX_Packet_Wait —— TX_Init
                 上层调用发包    主循环调用       Lora发包回调        收到Ack包
                SendPacket    LoraWriteAsync   TxCallBack      或超时准备重发
  发路由包时: 不控制状态，直接发送 通过is_send_route判断当前是否在发路由包，防止LoraWriteAsync的冲突
 */

#define MAX_REAL_LORA_PACKET_SIZE 256

// --------------------- 信号传递使用队列 -----------------------;
/**
 * @brief 实际上考虑队列中各个信号出现的可能性,不会出现信号放不进去的情况.ACK包发送信号至多出现一次,
 *  由于接收buffer只有一个接收信号也至多出现一次.发送信号和重传信号不会同时出现,且至多出现一次.
 *  因此实际上当前实现信号队列至多同时出现三个信号
 */
QueueHandle_t data_link_queue;
StaticQueue_t data_link_queue_buffer;
DataLinkSignal data_link_queue_storage[DATALINK_QUEUE_LEN];
// ---------------------------END------------------------------;

// --------------------------semophore-------------------------;
/**
 * @brief TODO: M3涉及中心服务器通讯时使用
 */
SemaphoreHandle_t data_link_wifi_semaphore;
StaticSemaphore_t data_link_wifi_semaphore_buffer;

/**
 * @brief 这个semaphore负责通知发送函数发送过程已经结束,状态在data_link_tx_state中
 * @note 此semaphore不必要
 */
SemaphoreHandle_t data_link_tx_semaphore;
StaticSemaphore_t data_link_tx_semaphore_buffer;

/**
 * @brief 此semaphore管理receive buffer,保证buffer内包不被改变
 */
SemaphoreHandle_t data_link_rx_buffer_semaphore;
StaticSemaphore_t data_link_rx_buffer_semaphore_buffer;

// ---------------------------END------------------------------;

// ---------------------------timer----------------------------;
/**
 * @brief 此定时器负责判断包是否超时
 */
TimerHandle_t datalink_resend_timer;
StaticTimer_t datalink_resend_timer_buffer;

// m3新增
/**
 * @brief 此定时器负责判断包是否超时
 */
TimerHandle_t network_route_timer;
StaticTimer_t network_route_timer_buffer;

// ---------------------------END------------------------------;

// --------------------datalink global states------------------;
/**
 * @brief 当前是发送函数的返回值,实际上不需要
 */
DataLinkError data_link_tx_state;

/**
 * @brief 当前数据链路层普通包传输状态
 */
DataLinkSignal datalink_send_state;

/**
 * @brief 当前Lora模块是否在传输ACK/NAK包/普通包
 */
bool is_send_ack, is_send_route, is_send_normal, is_send_transfer;

/**
 * @brief 当前发包的service号
 */
LoraService send_service_number;

/**
 * @brief 是否开启数据链路层接收包回调
 */
bool is_datalink_receive;

/**
 * @brief 维护数据链路层buffer状态
 */
bool transmit_buffer_avaliable;

/**
 * @brief ACK buffer是否可用
 */
bool ack_buffer_avaliable;

// m3 新增 Route buffer是否可用

bool route_buffer_avaliable;

bool transfer_buffer_available;
/**
 * @brief LoRa收到包的长度
 */
uint8_t datalink_rx_packet_length;
// ---------------------------END------------------------------;

// ------------------Callback and Buffer-----------------------;

/**
 * @brief 注册服务回调函数
 */
LoraPacketCallback_t lora_packet_callback[LORA_SERVICE_NUM] = {nullptr};
LoraPacketCallback_t lora_send_callback[LORA_SERVICE_NUM] = {nullptr};

/**
 * @brief ACK/NAK包buffer
 */
uint8_t datalink_tx_real_buffer[MAX_REAL_LORA_PACKET_SIZE];
uint8_t datalink_rx_real_buffer[MAX_REAL_LORA_PACKET_SIZE];
uint8_t datalink_ack_real_buffer[sizeof(LoraPacketHeader)];
// m3新增  发送路由包的buffer
uint8_t datalink_route_real_buffer[MAX_REAL_LORA_PACKET_SIZE];
LoraPacket *datalink_route_buffer = (LoraPacket *)datalink_route_real_buffer;
// dbq我又开了一个buffer
uint8_t datalink_transfer_real_buffer[MAX_REAL_LORA_PACKET_SIZE];
LoraPacket *datalink_transfer_buffer = (LoraPacket *)datalink_transfer_real_buffer;

LoraPacketHeader *datalink_ack_buffer = (LoraPacketHeader *)datalink_ack_real_buffer;

/**
 * @brief 发送buffer
 */
LoraPacket *datalink_transmit_buffer = (LoraPacket *)datalink_tx_real_buffer;

/**
 * @brief 接收buffer
 */
LoraPacket *datalink_receive_buffer = (LoraPacket *)datalink_rx_real_buffer;

/**
 * @brief heard list
 * @note unused
 */
// HeardList *heard_list;
HeardList HeardLists[MaxHeardListNum];

/*m3新增*/
// 序列号,作为全局变量
// 发普通包时0-1-0-1来回变化
// 发路由包默认seq=0（因为不需要ack）
uint8_t seq = 0;
// crc_value
uint32_t crc_value = 0;
/**
 * @brief 本机注册的服务
 * @note unused
 */
uint8_t registered_service;
// ---------------------------END------------------------------;

// 上层通过调此函数注册回调函数(true=发包 false=收包)
void DataLinkRegisterService(bool func_select, LoraService service, LoraPacketCallback_t callback) {
  assert(service <= LORA_SERVICE_NUM);
  if (func_select) {
    lora_send_callback[service] = callback;
  } else {
    lora_packet_callback[service] = callback;
  }
}

// 上层调用此函数说明开始收包
void DataLinkReceivePacketBegin() {
  LoraReadAsyncStart();
  is_datalink_receive = true;
}

// 上层调用此函数说明截止收包
void DataLinkReceivePacketEnd() {
  LoraReadAsyncStop();
  is_datalink_receive = false;
}

// 上层声明发送buffer —— 发送buffer不可用
uint32_t DataLinkDeclareTransmitBuffer() {
  if (transmit_buffer_avaliable) {
    transmit_buffer_avaliable = false;
  } else {
    return 0;
  }
  return sizeof(datalink_transmit_buffer);
}

// 上层释放发送buffer —— 发送buffer又可用
uint32_t DataLinkReleaseTransmitBuffer() {
  assert(transmit_buffer_avaliable == false);
  transmit_buffer_avaliable = true;
  return sizeof(datalink_transmit_buffer);
}

// 链路层发包
DataLinkError DataLinkSendPacket(LoraService service, LoraPacket *pak, uint32_t hop) {
  UNUSED(hop);
  // 上层已经将包填到发送buffer中
  assert(pak == datalink_transmit_buffer);
  // 上层已经声明了发送buffer
  assert(transmit_buffer_avaliable == false);
  // m3修改
  /*发包前，填入序列号 魔数 源地址 当前结点地址*/
  pak->header.settings.seq = seq;
  seq ^= 1;
  pak->header.magic_number = LORA_MAGIC_NUMBER;
  pak->header.src_addr = LORA_ADDR;
  pak->header.curr_addr = LORA_ADDR;
  // 根据中转地址填入
  DataLinkRoute(pak);
#ifdef DATALINK_DBG
  printf("[DataLink Route] fill DataLinkRoute()\r\n");
#endif
  // TX_Packet通知主循环进行发包
  DataLinkSignal queue_signal = TX_Packet;
  if (xQueueSend(data_link_queue, &queue_signal, portMAX_DELAY) != pdTRUE) {
    return DataLink_Busy;
  }
  send_service_number = service;
  return DataLink_OK;
}

// 超时重发的回调函数，当发包定时器到时后，就会调此函数
void DataLinkResendCallBack(TimerHandle_t xTimer) {
  // 此时应处于TX_Packet_Wait状态
  assert(datalink_send_state == TX_Packet_Wait);
  datalink_send_state = TX_Init;
  printf("[Timer] Time Out\r\n");
  // TX_Retry通知主循环重发包
  DataLinkSignal queue_signal = TX_Retry;
  xQueueSend(data_link_queue, &queue_signal, portMAX_DELAY);
  portYIELD();
}

