lan-hx/stm32_lora/tasks/service/web/data_link.cpp
// m3新增
/*定时发送路由包，暂定5s一次*/
void NetworkRouteCallBack(TimerHandle_t xTimer) {
  DataLinkHeardListTick();  // 清除本地路由表的过期项
  // TX_Route_Packet通知主循环发路由包
  DataLinkSignal queue_signal = TX_Route_Packet;
  xQueueSend(data_link_queue, &queue_signal, portMAX_DELAY);
  portYIELD();  // 让出CPU
}

/**
 * @brief LoRa模块的异步接收回调函数
 *
 * @param s 数据包
 * @param len 数据包长度
 * @param state 接收状态
 */

// Lora收到一个包后,将包拷贝到接收buffer,同时RX_Packet通知主循环收包
//    这时候拿着data_link_rx_buffer_semaphore锁,等主循环收完包就放锁
void LoraRxCallback(const uint8_t *s, uint8_t len, LoraError state) {
  if (state != Lora_OK && state != Lora_CRCError) {
    return;
  }
  if (xSemaphoreTake(data_link_rx_buffer_semaphore, 0) == pdTRUE) {
    datalink_rx_packet_length = len;
    memset(datalink_receive_buffer, 0, MAX_REAL_LORA_PACKET_SIZE);
    memcpy(datalink_receive_buffer, s, len);
    DataLinkSignal queue_signal = RX_Packet;
    if (xQueueSend(data_link_queue, &queue_signal, portMAX_DELAY) == pdTRUE) {
#ifdef DATALINK_DBG
      printf("[CallBack From Lora] Receive a packet.\r\n");
#endif
    } else {
      xSemaphoreGive(data_link_rx_buffer_semaphore);
    }
  }
}

/**
 * @brief 发包中断回调函数, 更新LoRa发送模块状态
 * @param[in] state 发包反馈
 * @note 确定发送状态
 */
// 发送 ACK包/路由包/普通包 成功/失败 都加了输出
void LoraTxCallback(LoraError state) {
  // 发送成功
  if (state == Lora_OK) {
    // 发送的是ACK包
    if (is_send_ack) {
      printf("[LoraTxCallback]Send an ack packet successfully!\r\n");
      is_send_ack = false;
      // ack buffer变成可用,即可以再发其他ack包
      ack_buffer_avaliable = true;
    }
    // 发送的是路由包
    else if (is_send_route) {
      printf("[LoraTxCallback]Send a route packet successfully!\r\n");
      is_send_route = false;
      // route buffer变成可用,即可以发送新的路由包了
      route_buffer_avaliable = true;
      // 开启路由定时器,为了周期性发送路由包
      xTimerStart(network_route_timer, 0);
    }
    // 发送的是转发包
    else if (is_send_transfer) {
      printf("[LoraTxCallback]Send a transfer packet successfully!\r\n");
      is_send_transfer = false;
      transfer_buffer_available = true;
    }
    // 发送的是普通包
    else {
      printf("[LoraTxCallback]Send a normal packet successfully!\r\n");
      is_send_normal = false;
      datalink_send_state = TX_Packet_Wait;  // 状态变为等待Ack
      // 开启定时器,为了重传
      xTimerStart(datalink_resend_timer, 0);
    }
#ifdef DATALINK_DBG
    printf("[CallBack From Lora] Send a packet succ.\r\n");
#endif
  }
  // 发送失败
  else {
    // 发送ACK包失败
    if (is_send_ack) {
      is_send_ack = false;
      // TX_Ack通知主循环重发Ack包
      DataLinkSignal queue_signal = TX_Ack;
      xQueueSend(data_link_queue, &queue_signal, portMAX_DELAY);
      printf("[LoraTxCallback]Failed to send an ack packet!\r\n");
    }
    // 发送路由包失败
    else if (is_send_route) {
      is_send_route = false;
      // TX_Route_Packet通知主循环发送路由包
      DataLinkSignal queue_signal = TX_Route_Packet;
      xQueueSend(data_link_queue, &queue_signal, portMAX_DELAY);
      printf("[LoraTxCallback]Failed to send a route packet!\r\n");
    }
    // 发送的是转发包
    else if (is_send_transfer) {
      is_send_transfer = false;
      // TX_Route_Packet通知主循环发送路由包
      DataLinkSignal queue_signal = TX_Transfer_Packet;
      xQueueSend(data_link_queue, &queue_signal, portMAX_DELAY);
      printf("[LoraTxCallback]Failed to Send a transfer packet!\r\n");
    }
    // 发送普通包失败
    else {
      is_send_normal = false;
      // TX_Retry通知主循环重传
      DataLinkSignal queue_signal = TX_Retry;
      datalink_send_state = TX_Init;
      xQueueSend(data_link_queue, &queue_signal, portMAX_DELAY);
      printf("[LoraTxCallback]Failed to send a normal packet!\r\n");
    }
  }
}

const HeardList *DataLinkGetHeardList() { return HeardLists; }

// m3新增函数
/*供上层调用，调用此函数后，该结点开始定期向外界转发路由包*/
void NetworkBeginRoute() {
  printf("**{NetWork Route Start}**!\r\n");
  DataLinkSignal queue_signal = TX_Route_Packet;
  xQueueSend(data_link_queue, &queue_signal, portMAX_DELAY);
}

// m3新增函数
/*根据本地的路由信息，填写路由包*/
void PrepareRoutePacket(LoraPacket *route_packet) {
  // 路由包的序列号都为0
  route_packet->header.settings.seq = 0;
  // 填入源地址  目标地址(FF表示广播)  包的长度=最大长度  当前地址
  route_packet->header.dest_addr = 0xFF;
  route_packet->header.src_addr = LORA_ADDR;
  route_packet->header.curr_addr = LORA_ADDR;
  route_packet->header.magic_number = LORA_MAGIC_NUMBER;
  route_packet->header.transfer_addr[0] = route_packet->header.transfer_addr[1] = 0;
  NetworkLinkStatePacket *link_state_pack = (NetworkLinkStatePacket *)(route_packet->content);
  memset(link_state_pack, 0, MAX_LORA_CONTENT_LENGTH);
  // 向路由包填入内容，遍历本地的路由表
  link_state_pack->sender_addr = LORA_ADDR;
  // link_state_pack->registered_service = LORA_SERVICE_LINK_STATE;
  int num = 0;
  for (int i = 0; i < MaxHeardListNum; i++) {
    if (HeardLists[i].tick > 0 && HeardLists[i].cost == 1) {  // 不经中转
      link_state_pack->neighbor[num].next_addr = HeardLists[i].addr;
      link_state_pack->neighbor[num].next_next_addr = 0xFF;
      link_state_pack->neighbor[num].registered_service = LORA_SERVICE_LINK_STATE;
      num++;
    } else if (HeardLists[i].tick > 0 && HeardLists[i].cost == 2) {  // 经一跳中转
      link_state_pack->neighbor[num].next_addr = HeardLists[i].next_addr;
      link_state_pack->neighbor[num].next_next_addr = HeardLists[i].addr;
      link_state_pack->neighbor[num].registered_service = LORA_SERVICE_LINK_STATE;
      num++;
    }
    // cost=3的无需在填入路由包，转发给邻居了
    link_state_pack->num = num;
  }
  // 填入包的长度 = 包头长度+ 2个uint8_t(num sender_addr) + (路由条目数*3)个uint8_t
  route_packet->header.length = sizeof(LoraPacketHeader) + 2 * sizeof(uint8_t) + num * sizeof(uint8_t) * 3;
}

// m3新增函数  填写中转地址，如果找不到中转地址则返回0，找到返回1
/*函数作用：根据本地路由表信息，在LoraPacket里面填入中转地址信息transfer_addr
qx修改:transfer_addr数组最多两个元素，只记中转地址，不计目标地址*/
bool DataLinkRoute(LoraPacket *pak) {
  for (auto a : HeardLists) {
    if (a.addr == pak->header.dest_addr) {
      if (a.cost == 1) {  // 不需中转
        pak->header.transfer_addr[0] = 0xFF;
        pak->header.transfer_addr[1] = 0xFF;
      }
      if (a.cost == 2) {  // 经一跳中转
        pak->header.transfer_addr[0] = a.next_addr;
        pak->header.transfer_addr[1] = 0xFF;
      }
      if (a.cost == 3) {  // 经两跳中转
        pak->header.transfer_addr[0] = a.next_addr;
        pak->header.transfer_addr[1] = a.next_next_addr;
      }
      return 1;
    }
  }
  return 0;
}

void DataLinkHeardListTick() {
  for (auto a : HeardLists) {
    if (a.tick > 0) {
      a.tick -= HeardListTickReduce;
    }
  }
}

