lan-hx/stm32_lora/tasks/service/web/data_link.cpp
// m3新增
/*根据收到的路由包，更新本地路由信息*/
void NetworkUpdateHeardList(NetworkLinkStatePacket *pack) {
  int HeardListOverstack = 1;
  int inlist = 0;
  for (int j = 0; j < MaxHeardListNum; j++) {
    if (HeardLists[j].tick > 0 && HeardLists[j].addr == pack->sender_addr) {
      HeardLists[j].tick = HeardListTicks;
      HeardLists[j].addr = pack->sender_addr;
      HeardLists[j].next_addr = pack->sender_addr;
      HeardLists[j].cost = 1;
      //   HeardLists[j].registered_service = pack->registered_service;
      inlist = 1;
      HeardListOverstack = 0;
      break;
    }
  }
  if (!inlist) {
    for (int j = 0; j < MaxHeardListNum; j++) {
      if (HeardLists[j].tick == 0) {
        HeardLists[j].tick = HeardListTicks;
        HeardLists[j].addr = pack->sender_addr;
        HeardLists[j].next_addr = pack->sender_addr;
        HeardLists[j].cost = 1;
        // HeardLists[j].registered_service = pack->registered_service;
        HeardListOverstack = 0;
        break;
      }
    }
  }
  if (HeardListOverstack) {
    assert(HeardListOverstack < 1);
  }

  for (int i = 0; i < pack->num; i++) {
    inlist = 0;
    HeardListOverstack = 1;
    for (int j = 0; j < MaxHeardListNum; j++) {
      if (HeardLists[j].tick > 0 && HeardLists[j].addr == pack->neighbor[i].next_addr) {
        if (HeardLists[j].cost == 1) {
          inlist = 1;
          HeardListOverstack = 0;
          break;
        }
        HeardLists[j].tick = HeardListTicks;
        HeardLists[j].addr = pack->neighbor[i].next_addr;
        HeardLists[j].next_addr = pack->sender_addr;
        HeardLists[j].cost = 2;
        HeardLists[j].registered_service = pack->neighbor[i].registered_service;
        inlist = 1;
        HeardListOverstack = 0;
        break;
      }
      if (HeardLists[j].tick > 0 && HeardLists[j].addr == pack->neighbor[i].next_next_addr) {
        if (HeardLists[j].cost < 3) {
          inlist = 1;
          HeardListOverstack = 0;
          break;
        }
        HeardLists[j].tick = HeardListTicks;
        HeardLists[j].addr = pack->neighbor[i].next_next_addr;
        HeardLists[j].next_addr = pack->sender_addr;
        HeardLists[j].next_next_addr = pack->neighbor[i].next_addr;
        HeardLists[j].cost = 3;
        HeardLists[j].registered_service = pack->neighbor[i].registered_service;
        inlist = 1;
        HeardListOverstack = 0;
        break;
      }
    }
    if (!inlist) {
      for (int j = 0; j < MaxHeardListNum; j++) {
        if (HeardLists[j].tick == 0) {
          if (pack->neighbor[i].next_addr != 0xFF && pack->neighbor[i].next_addr != LORA_ADDR) {
            HeardLists[j].tick = HeardListTicks;
            HeardLists[j].addr = pack->neighbor[i].next_addr;
            HeardLists[j].next_addr = pack->sender_addr;
            HeardLists[j].cost = 2;
            HeardLists[j].registered_service = pack->neighbor[i].registered_service;
            HeardListOverstack = 0;
            break;
          } else if (pack->neighbor[i].next_next_addr != 0xFF && pack->neighbor[i].next_next_addr != LORA_ADDR) {
            HeardLists[j].tick = HeardListTicks;
            HeardLists[j].addr = pack->neighbor[i].next_next_addr;
            HeardLists[j].next_addr = pack->sender_addr;
            HeardLists[j].next_next_addr = pack->neighbor[i].next_addr;
            HeardLists[j].cost = 3;
            HeardLists[j].registered_service = pack->neighbor[i].registered_service;
            inlist = 1;
            HeardListOverstack = 0;
            break;
          }
        }
      }
    }
    if (HeardListOverstack) {
      //      assert(HeardListOverstack < 1);
    }
  }
}

// 打印本地路由包，为了调试
void PrintRouteTable(void) {
  //  for (int i = 0; i < 4; i++) {
  //    printf("HeardLists[%d],addr =%x, next_addr = %x, next_next_addr = %x,cost=%d,tick = %d \r\n", i,
  //    HeardLists[i].addr,
  //           HeardLists[i].next_addr, HeardLists[i].next_next_addr, HeardLists[i].cost, HeardLists[i].tick);
  //  }
}
// 打印发送的路由包，为了调试
void PrintRoutePacket(void) {
  //  printf("---------------Route Packet Information----------------\r\n");
  //  NetworkLinkStatePacket *pak = (NetworkLinkStatePacket *)datalink_route_buffer->content;
  //  printf("    route packet entry num = %d\r\n", pak->num);
  //  for (int i = 0; i < pak->num; i++) {
  //    printf("    next_addr = %X  next_next_addr = %X\r\n", pak->neighbor[i].next_addr,
  //    pak->neighbor[i].next_next_addr);
  //  }
  //  printf("------------------------------------------------------\r\n");
}
/**
 * @brief 数据链路层事件处理
 */
void DataLinkEventLoop() {
  DataLinkSignal opt;
  bool crc_state = false;
  datalink_send_state = TX_Init;
  is_send_ack = false, is_send_route = false, is_send_normal = false, is_send_transfer = false;
  //  send_service_number = LORA_SERVICE_UNAVALIABLE;
  send_service_number = LORA_SERVICE_LINK_STATE;
  is_datalink_receive = false;

  transmit_buffer_avaliable = true, ack_buffer_avaliable = true, route_buffer_avaliable = true,
  transfer_buffer_available = true;
  uint8_t retry_count = 0;
  xSemaphoreGive(data_link_rx_buffer_semaphore);
  while (true) {
    xQueueReceive(data_link_queue, &opt, portMAX_DELAY);
#ifdef DATALINK_DBG
    printf("[DataLink MainLoop] running, operation = %d\r\n", opt);
#endif
    switch (opt) {
      // 收包逻辑:
      /* 目的地址是自己，则直接发 —— m2已实现
         中转地址是自己 —— 转发这个包(需要修改包头的curr_addr为自己)
         广播包 —— 根据路由包更新本地路由包 NetworkUpdateHeardList(NetworkLinkStatePacket *pack)
         其他情况 —— 丢弃(类似于m2对目的地址不是自己的包的处理)
       */
      case RX_Packet: {
        // 上一跳的结点不是拒绝的才会接受这个包
        if (datalink_receive_buffer->header.magic_number == LORA_MAGIC_NUMBER &&
            datalink_receive_buffer->header.curr_addr != REJECTED_LORA_ADDR) {
          if (datalink_rx_packet_length < 8 || datalink_rx_packet_length != datalink_receive_buffer->header.length) {
#ifdef DATALINK_DBG
            printf("[DataLink MainLoop] warning: Packet length not correct!\r\n");
#endif
          }
          // CRC校验，校验通过:crc_state=true,否则crc_state=false
          //                                 检验不通过有输出
          // CRC校验过不去
          crc_state = true;
          uint8_t packet_crc = datalink_receive_buffer->header.crc;
          datalink_receive_buffer->header.crc = 0;
          crc_value = HAL_CRC_Calculate(&hcrc, (uint32_t *)datalink_receive_buffer,
                                        (datalink_receive_buffer->header.length + 3) / 4);
          uint8_t crc_xor =
              (crc_value & 0xFF) ^ ((crc_value >> 8) & 0xFF) ^ ((crc_value >> 16) & 0xFF) ^ ((crc_value >> 24) & 0xFF);
          if (crc_xor == packet_crc) {
            crc_state = true;
          } else {
            printf("[DataLink MainLoop] Datalink crc incorrect!\r\n");
          }
          // 收到目的地址是自己的包，这部分和m2一样
          if (datalink_receive_buffer->header.dest_addr == LORA_ADDR) {
            // 收到ack包
            if (datalink_receive_buffer->header.settings.ack) {
              printf("RECEIVE A ACK\r\n");
              if (crc_state && datalink_send_state == TX_Packet_Wait &&
                  datalink_receive_buffer->header.settings.seq == datalink_transmit_buffer->header.settings.seq) {
                // 回到TX_Init状态
                datalink_send_state = TX_Init;
                // 停止重传定时器
                xTimerStop(datalink_resend_timer, 0);
                // 收到ack包，会调上层的发包回调，send_state = DataLink_OK
                lora_send_callback[send_service_number](nullptr, DataLink_OK);
                //                send_service_number = LORA_SERVICE_UNAVALIABLE;
              }
              xSemaphoreGive(data_link_rx_buffer_semaphore);
            }
            // 收到nack包
            else if (datalink_receive_buffer->header.settings.nak) {
              if (crc_state && datalink_send_state == TX_Packet_Wait &&
                  datalink_receive_buffer->header.settings.seq == datalink_transmit_buffer->header.settings.seq) {
                // 回到TX_Init状态
                datalink_send_state = TX_Init;
                // 停止重传定时器
                xTimerStop(datalink_resend_timer, 0);
                // 直接重传
                DataLinkSignal queue_signal = TX_Retry;
                xQueueSend(data_link_queue, &queue_signal, portMAX_DELAY);
#ifdef DATALINK_DBG
                printf("[DataLink MainLoop] Receive a NAK packet, retransmit!\r\n");
#endif
              }
              xSemaphoreGive(data_link_rx_buffer_semaphore);
            }
            // 收到普通包
            else {
              // 此时ack_buffer不可用(即上一个要发送的ack还没有发送,则一会儿再收这个包)
              if (!ack_buffer_avaliable) {
                DataLinkSignal queue_signal = RX_Packet;
                xQueueSend(data_link_queue, &queue_signal, portMAX_DELAY);
                break;
              }
              ack_buffer_avaliable = false;
              // 如果路由表里还没有目标地址的项，之后再发送
              if (crc_state) {  // 校验通过发送ACK
                uint8_t service_number = datalink_receive_buffer->header.settings.service;
                if (is_datalink_receive && service_number < LORA_SERVICE_NUM &&
                    lora_packet_callback[service_number] != nullptr) {
                  lora_packet_callback[service_number](datalink_receive_buffer, 0);
                }
                datalink_ack_buffer->dest_addr = datalink_receive_buffer->header.src_addr;
                datalink_ack_buffer->transfer_addr[0] = datalink_ack_buffer->transfer_addr[1] = 0;
                datalink_ack_buffer->curr_addr = LORA_ADDR;

                datalink_ack_buffer->src_addr = LORA_ADDR;
                datalink_ack_buffer->magic_number = LORA_MAGIC_NUMBER;
                datalink_ack_buffer->settings = {
                    datalink_receive_buffer->header.settings.seq, true, false, false, 0, 0};
                datalink_ack_buffer->length = sizeof(LoraPacketHeader);
                datalink_ack_buffer->crc = 0;
              } else {  // 校验未通过发送nak
                // 发送nak
                datalink_ack_buffer->dest_addr = datalink_receive_buffer->header.src_addr;
                datalink_ack_buffer->transfer_addr[0] = datalink_ack_buffer->transfer_addr[1] = 0;
                datalink_ack_buffer->curr_addr = LORA_ADDR;
                datalink_ack_buffer->src_addr = LORA_ADDR;
                datalink_ack_buffer->magic_number = LORA_MAGIC_NUMBER;
                datalink_ack_buffer->settings = {
                    datalink_receive_buffer->header.settings.seq, false, false, true, 0, 0};
                datalink_ack_buffer->length = sizeof(LoraPacketHeader);
                datalink_ack_buffer->crc = 0;
              }
              xSemaphoreGive(data_link_rx_buffer_semaphore);
              // 如果ACK包目前填不了中转地址，则先不回这个ACK，把ack_buffer让出来
              if (!DataLinkRoute((LoraPacket *)datalink_ack_buffer)) {
                ack_buffer_avaliable = false;
                break;
              }
              // 压入TX_Ack，来发送ACK包
              DataLinkSignal queue_signal = TX_Ack;
              xQueueSend(data_link_queue, &queue_signal, portMAX_DELAY);
            }
          }
          // 收到中转地址是自己的包，转发
          else if (datalink_receive_buffer->header.transfer_addr[0] == LORA_ADDR ||
                   datalink_receive_buffer->header.transfer_addr[1] == LORA_ADDR) {
            // 如果此时我的中转buffer不可用,则把RX_Packet压回去，过一会儿再收包
            if (!transfer_buffer_available) {
              DataLinkSignal queue_signal = RX_Packet;
              xQueueSend(data_link_queue, &queue_signal, portMAX_DELAY);
              break;
            }
            transfer_buffer_available = false;
            // 拷贝这个包到转发队列
            memcpy(datalink_transfer_buffer, datalink_receive_buffer, datalink_receive_buffer->header.length);
            xSemaphoreGive(data_link_rx_buffer_semaphore);
            DataLinkSignal queue_signal = TX_Transfer_Packet;
            xQueueSend(data_link_queue, &queue_signal, portMAX_DELAY);
            printf("[DataLink MainLoop] Receive a packet needed to transfer,dest = %X!\r\n",
                   datalink_receive_buffer->header.dest_addr);
          }
          // 收到广播的路由包
          else if (datalink_receive_buffer->header.dest_addr == 0xFF) {
            // 根据收到的路由包，更新本地的路由表
            NetworkUpdateHeardList((NetworkLinkStatePacket *)datalink_receive_buffer->content);
            xSemaphoreGive(data_link_rx_buffer_semaphore);
            // 打印路由表
            printf("Receive a route packet!\r\n");
            printf("------------------------------------\r\n");
            PrintRouteTable();
            printf("------------------------------------\r\n");
          }
          // 其他情况不作处理,释放接受buffer的锁(不再管这个包)
          else {
            xSemaphoreGive(data_link_rx_buffer_semaphore);
          }
          break;
        } else {
          xSemaphoreGive(data_link_rx_buffer_semaphore);
        }
      }
      // 发包逻辑
      case TX_Packet: {
        if (datalink_send_state == TX_Init) {
          /*m3修改*/
          // 如果该结点目前正在往外发ack包/路由包，则此时不能发包，把Tx_Packet信号压回队列，之后再发
          if (is_send_ack || is_send_route || is_send_transfer) {
            DataLinkSignal queue_signal = TX_Packet;
            xQueueSend(data_link_queue, &queue_signal, portMAX_DELAY);
            break;
          }
          // 长度为0的包不发
          if (datalink_transmit_buffer->header.length == 0) {
            break;
          }
          // 如果路由表里还没有目标地址的项，把TX_Packet信号压回队列，之后再发送
          if (!DataLinkRoute(datalink_transmit_buffer)) {
            // DataLinkSignal queue_signal = TX_Packet;
            // xQueueSend(data_link_queue, &queue_signal, portMAX_DELAY);
            break;
          }
          datalink_send_state = TX_Wait_Lora;
          retry_count = 0;
          // 新增
          datalink_transmit_buffer->header.crc = 0;
          // 确保发送的32字节的整数倍,不是的话后面填0
          memset(((uint8_t *)datalink_transmit_buffer) + datalink_transmit_buffer->header.length, 0,
                 (((uint32_t)datalink_transmit_buffer->header.length + 3) & 0xfffffffc) -
                     (uint32_t)datalink_transmit_buffer->header.length);
          // 计算crc并填入
          crc_value = HAL_CRC_Calculate(&hcrc, (uint32_t *)datalink_transmit_buffer,
                                        (datalink_transmit_buffer->header.length + 3) / 4);
          uint8_t crc_xor =
              (crc_value & 0xFF) ^ ((crc_value >> 8) & 0xFF) ^ ((crc_value >> 16) & 0xFF) ^ ((crc_value >> 24) & 0xFF);
          datalink_transmit_buffer->header.crc = crc_xor;
          // 发包
          is_send_normal = true;
          printf(
              "[DataLinkMainLoop]Send a normal packet!  src=%X  dst=%X  curr=%X  transfer[0]=%X transfer[1] = %X seq = "
              "%d length = %d\r\n ",
              datalink_transmit_buffer->header.src_addr, datalink_transmit_buffer->header.dest_addr,
              datalink_transmit_buffer->header.curr_addr, datalink_transmit_buffer->header.transfer_addr[0],
              datalink_transmit_buffer->header.transfer_addr[1], datalink_transmit_buffer->header.settings.seq,
              datalink_transmit_buffer->header.length);

          LoraWriteAsync((const uint8_t *)datalink_transmit_buffer, datalink_transmit_buffer->header.length, false);
        } else {
          // 如果调用发包时，上一个包还没有搞定，调上层回调，send_state = DataLink_Busy
          lora_send_callback[send_service_number](nullptr, DataLink_Busy);
          //          send_service_number = LORA_SERVICE_UNAVALIABLE;
        }
        break;
      }
      // m3新增,发送路由包
      case TX_Route_Packet: {
        // 如果route buffer还不可用，说明上一个路由包还没成功发送,则把TX_Route_Packet信号压回去，一会儿再发路由包
        if (!route_buffer_avaliable) {
          DataLinkSignal queue_signal = TX_Route_Packet;
          xQueueSend(data_link_queue, &queue_signal, portMAX_DELAY);
          break;
        }
        // 如果结点这时正在发送一个普通包/ACK/转发包,则把TX_Route_Packet信号压回去，一会儿再发路由包
        if (is_send_ack || is_send_normal || is_send_transfer) {
          DataLinkSignal queue_signal = TX_Route_Packet;
          xQueueSend(data_link_queue, &queue_signal, portMAX_DELAY);
          break;
        }
        // route buffer不可用
        route_buffer_avaliable = false;
        //  准备路由包
        PrepareRoutePacket(datalink_route_buffer);
        // 填写CRC
        datalink_route_buffer->header.crc = 0;
        memset(((uint8_t *)datalink_route_buffer) + datalink_route_buffer->header.length, 0,
               (((uint32_t)datalink_route_buffer->header.length + 3) & 0xfffffffc) -
                   (uint32_t)datalink_route_buffer->header.length);
        crc_value =
            HAL_CRC_Calculate(&hcrc, (uint32_t *)datalink_route_buffer, (datalink_route_buffer->header.length + 3) / 4);
        uint8_t crc_xor =
            (crc_value & 0xFF) ^ ((crc_value >> 8) & 0xFF) ^ ((crc_value >> 16) & 0xFF) ^ ((crc_value >> 24) & 0xFF);
        datalink_route_buffer->header.crc = crc_xor;
        // 当前正在发路由包
        is_send_route = true;
        // 打印发的路由包（调试用）
        //        printf("[DataLink MainLoop]Send a route packet!  src=%X  dst=%X  length=%d\r\n",
        //               datalink_route_buffer->header.src_addr, datalink_route_buffer->header.dest_addr,
        //               datalink_route_buffer->header.length);
        PrintRoutePacket();
        // 调用物理层异步发包
        LoraWriteAsync((const uint8_t *)datalink_route_buffer, datalink_route_buffer->header.length, false);
        break;
      }
      case TX_Transfer_Packet: {
        assert(is_send_transfer == false);
        // 如果正在发normal/ack/route包，则把TX_Transfer_Packet信号压回去，一会儿再转发这个包
        if (is_send_normal || is_send_ack || is_send_route) {
          DataLinkSignal queue_signal = TX_Transfer_Packet;
          xQueueSend(data_link_queue, &queue_signal, portMAX_DELAY);
          break;
        }
        // 转发的时候只需要改curr_addr为自己的地址
        datalink_transfer_buffer->header.curr_addr = LORA_ADDR;
        // 重新计算CRC
        datalink_transfer_buffer->header.crc = 0;
        memset(((uint8_t *)datalink_transfer_buffer) + datalink_transfer_buffer->header.length, 0,
               (((uint32_t)datalink_transfer_buffer->header.length + 3) & 0xfffffffc) -
                   (uint32_t)datalink_transfer_buffer->header.length);
        crc_value = HAL_CRC_Calculate(&hcrc, (uint32_t *)datalink_transfer_buffer,
                                      (datalink_transfer_buffer->header.length + 3) / 4);
        uint8_t crc_xor =
            (crc_value & 0xFF) ^ ((crc_value >> 8) & 0xFF) ^ ((crc_value >> 16) & 0xFF) ^ ((crc_value >> 24) & 0xFF);
        datalink_transfer_buffer->header.crc = crc_xor;
        // 调用物理层异步发包
        is_send_transfer = true;
        LoraWriteAsync((const uint8_t *)datalink_transfer_buffer, datalink_transfer_buffer->header.length, false);
        break;
      }
        // 发送ACK包
      case TX_Ack: {
        assert(is_send_ack == false);
        if (is_send_route || is_send_normal || is_send_transfer) {
          DataLinkSignal queue_signal = TX_Ack;
          xQueueSend(data_link_queue, &queue_signal, portMAX_DELAY);
          break;
        }
        // 填CRC
        datalink_ack_buffer->crc = 0;
        memset(((uint8_t *)datalink_ack_buffer) + datalink_ack_buffer->length, 0,
               (((uint32_t)datalink_ack_buffer->length + 3) & 0xfffffffc) - (uint32_t)datalink_ack_buffer->length);
        crc_value = HAL_CRC_Calculate(&hcrc, (uint32_t *)datalink_ack_buffer, (datalink_ack_buffer->length + 3) / 4);
        uint8_t crc_xor =
            (crc_value & 0xFF) ^ ((crc_value >> 8) & 0xFF) ^ ((crc_value >> 16) & 0xFF) ^ ((crc_value >> 24) & 0xFF);
        datalink_ack_buffer->crc = crc_xor;
        is_send_ack = true;
        printf("[DataLink MainLoop]Send an ack packet!  src=%X  dst=%X  seq=%d  length=%d\r\n",
               datalink_ack_buffer->src_addr, datalink_ack_buffer->dest_addr, datalink_ack_buffer->settings.seq,
               datalink_ack_buffer->length);
        LoraWriteAsync((const uint8_t *)datalink_ack_buffer, sizeof(LoraPacketHeader), true);
        break;
      }
      // 重传
      case TX_Retry: {
        assert(datalink_send_state == TX_Init);
        // 超过重传次数 直接调回调
        if (retry_count > DATA_LINK_RETRY - 1) {
          // 如果重传超过最大次数，调上层回调send_state = DataLink_TxFailed
          lora_send_callback[send_service_number](nullptr, DataLink_TxFailed);
          //          send_service_number = LORA_SERVICE_UNAVALIABLE;
          break;
        }
        // 正在发ack包或者路由包，把TX_Retry信号压回去，一会儿再重传
        if (is_send_ack || is_send_route || is_send_normal || is_send_transfer) {
          DataLinkSignal queue_signal = TX_Retry;
          xQueueSend(data_link_queue, &queue_signal, portMAX_DELAY);
          break;
        }
        datalink_send_state = TX_Wait_Lora;
        retry_count++;
#ifdef DATALINK_DBG
        printf("[DataLink MainLoop] Retransmit retry = %d\r\n", retry_count);
#endif
        //        printf(
        //            "[DataLinkMainLoop]Send a retry packet!  retry_count=%d  src=%X  dst=%X  curr=%X  transfer[0]=%X "
        //            "transfer[1]=%X  seq = %d "
        //            " length=%d  \r\n",
        //            retry_count, datalink_transmit_buffer->header.src_addr,
        //            datalink_transmit_buffer->header.dest_addr, datalink_transmit_buffer->header.curr_addr,
        //            datalink_transmit_buffer->header.transfer_addr[0],
        //            datalink_transmit_buffer->header.transfer_addr[1], datalink_transmit_buffer->header.settings.seq,
        //            datalink_transmit_buffer->header.length);
        printf("RETRY PACKET");
        // 发送重传包 也认为是在发送一个普通包
        is_send_normal = true;
        LoraWriteAsync((const uint8_t *)datalink_transmit_buffer, datalink_transmit_buffer->header.length, false);
        break;
      }
      default: {
        break;
      }
    }
  }
}
